<template>
  <div class="news">
    <h2>Останні новини</h2>
    <article v-for="(newsItem, index) in newsList" :key="index">
      <h3>{{ newsItem.title }}</h3>
      <p>{{ newsItem.content }}</p>
      <a :href="newsItem.link">Читати далі</a>
    </article>
  </div>
</template>

<script>
export default {
  data() {
    return {
      newsList: [
        {
          title: 'Нова функція: Інтеграція з популярними кулінарними блогами',
          content: 'Ми раді повідомити вам про важливе оновлення. Тепер ми інтегрували можливість підключення до популярних кулінарних блогів, щоб ви могли отримувати актуальні рецепти та ідеї безпосередньо у вашому обліковому записі. Це дозволить вам заощадити час на пошуку нових інспірацій та рецептів та легко інтегрувати їх у ваше меню.',
          link: '#'
        },
        {
          title: 'Відкриття нового розділу: Сезонні рецепти',
          content: 'Ми завжди працюємо над розвитком нашого сайту, і зараз ми з радістю оголошуємо відкриття нового розділу "Сезонні рецепти". Тут ви знайдете найсмачніші та найактуальніші страви, які відповідають поточному сезону та погоді. Цей розділ допоможе вам підтримувати меню в актуальному стані та задовольняти смаки вашого клієнтського аудиторії.',
          link: '#'
        }
        // Додайте інші новини за потребою
      ]
    };
  }
};
</script>

<style scoped>
.news {
  max-width: 80%;
  margin: 0 5% auto;
}

article {
  margin-bottom: 30px;
}

h2 {
  color: #333;
}

h3 {
  color: #007BFF;
}

p {
  color: #555;
}

a {
  color: #007BFF;
  text-decoration: none;
  font-weight: bold;
}

a:hover {
  text-decoration: underline;
}
</style>